## [Power-Ups for Jupyter Notebooks](https://towardsdatascience.com/power-ups-for-jupyter-notebooks-ebfa6e5e57a) by Shyam Choudhary

### 1. Hinterland
Hinterland enables code autocompletion menu for every keypress in a code cell, instead of only calling it with the tab. This makes Jupyter notebookâ€™s autocompletion behave like other popular IDEs such as PyCharm and VCS.

In [1]:
import pandas as pd

### Split Cells

In [7]:
df = pd.read_html('https://en.wikipedia.org/wiki/List_of_states_and_territories_of_the_United_States')

In [10]:
df[0].head()

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,Name &postal abbreviation[12],Cities,Established[C],Population[D][14],Total area[15],Land area[15],Water area[15],Numberof Reps.,NaN,NaN,NaN,NaN,NaN
1,Capital,Largest[16],mi2,km2,mi2,km2,mi2,km2,NaN,NaN,NaN,NaN,NaN
2,Alabama,AL,Montgomery,Birmingham,"Dec 14, 1819",4874747,52420,135767,50645.0,131171.0,1775.0,4597.0,7.0
3,Alaska,AK,Juneau,Anchorage,"Jan 3, 1959",739795,665384,1723337,570641.0,1477953.0,94743.0,245384.0,1.0
4,Arizona,AZ,Phoenix,"Feb 14, 1912",7016270,113990,295234,113594,294207.0,396.0,1026.0,9.0,NaN

In [11]:
df[0].tail()

,0,1,2,3,4,5,6,7,8,9,10,11,12
47,Virginia[E],VA,Richmond,Virginia Beach,"Jun 25, 1788",8470020,42775,110787,39490.0,102279.0,3285.0,8508.0,11.0
48,Washington,WA,Olympia,Seattle,"Nov 11, 1889",7405743,71298,184661,66456.0,172119.0,4842.0,12542.0,10.0
49,West Virginia,WV,Charleston,"Jun 20, 1863",1815857,24230,62756,24038,62259.0,192.0,497.0,3.0,NaN
50,Wisconsin,WI,Madison,Milwaukee,"May 29, 1848",5795483,65496,169635,54158.0,140268.0,11339.0,29367.0,8.0
51,Wyoming,WY,Cheyenne,"Jul 10, 1890",579315,97813,253335,97093,251470.0,720.0,1864.0,1.0,NaN

### Collapsible Headings

### Slideshows

### Interactions!